####################
# Taps
####################
# "brew tap"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
# Fonts
tap "homebrew/cask-fonts"

# Install GNU core utilities (those that come with OS X are outdated).
brew "coreutils"
# Install some other useful utilities like `sponge`.
brew "moreutils"
# Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed.
brew "findutils"
# Install File comparison utilities
brew "diffutils"

## Version Control
brew "git"
# Git extension for versioning large files
brew "git-lfs"
#  GitHub’s official command line tool
brew "gh"
# Good-lookin" diffs with diff-highlight and more
brew "diff-so-fancy"

## Shells
# fish shell
brew "fish"

# Node Version Manager
brew "fnm"

brew "pyenv"
brew "python"
brew "sqlite"

# System related
# Install other useful binaries.
# Search tool like grep, but optimized for programmers
brew "ack"
# Monitor data"s progress through a pipe
brew "pv"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# brew install rlwrap
# Add a public key to a remote machine"s authorized_keys file
brew "ssh-copy-id"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Access GitHub"s .gitignore boilerplates
# brew install gibo
brew "wget"
#  A simple, fast and user-friendly alternative to "find"
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# A file watching service
brew "watchman"

# Misc
brew "brew-cask-completion"
brew "thefuck"
# Sentry command line tool
brew "install getsentry/tools/sentry-cli"

####################
# Cask
####################
# Install tools using Homebrew Cask
# See: https://github.com/Homebrew/homebrew-cask
# "brew install --cask"
# Browser
cask "firefox"
cask "google-chrome"

# Terminals
cask "iterm2"

# Chat / IM
cask "discord"
cask "slack"

# Misc
cask "postman"
cask "spotify"
cask "the-unarchiver"
cask "font-hack-nerd-font"

# Java Development Kit
cask "adoptopenjdk/openjdk/adoptopenjdk13"

# Editors
cask "visual-studio-code"
cask "atom"
# Android Studio provides the fastest tools for building apps on every type of Android device.
cask "android-studio"

# Fonts
cask "font-anonymous-pro"
cask "font-blex-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-fira-code"
cask "font-fira-mono"
cask "font-fira-sans"

####################
# Mas
####################
# Mac App Store applications
brew "mas"

# "mas install"
mas "Xcode", id: 497799835
